In [1]:
import pandas as pd

In [2]:
path = 'data.csv'

In [3]:
path

'data.csv'

In [8]:
df=pd.read_csv(path, encoding ='cp949')

In [9]:
df.head()

  이름    연도  포인트
0  A  2013  1.5
1  B  2014  3.2
2  C  2015  2.4
3  D  2016  1.8
4  E  2017  2.3

In [16]:
df['이름']='AAA'

In [20]:
df

    이름    연도  포인트
0  AAA  2013  0.0
1  AAA  2014  0.0
2  AAA  2015  0.0
3  AAA  2016  0.0
4  AAA  2017  0.0
5  AAA  2018  0.0
6  AAA  2019  0.0
7  AAA  2020  0.0

In [18]:
df['포인트']=0.0

In [21]:
df

    이름    연도  포인트
0  AAA  2013  0.0
1  AAA  2014  0.0
2  AAA  2015  0.0
3  AAA  2016  0.0
4  AAA  2017  0.0
5  AAA  2018  0.0
6  AAA  2019  0.0
7  AAA  2020  0.0

In [22]:
df[df['연도'] >=2016]

    이름    연도  포인트
3  AAA  2016  0.0
4  AAA  2017  0.0
5  AAA  2018  0.0
6  AAA  2019  0.0
7  AAA  2020  0.0